/**
 * @see https://prettier.io/docs/configuration
 * @type {import("prettier").Config}
 */
export default {
    // Управляет добавлением скобок вокруг параметров стрелочных функций. Возможные значения: "always", "avoid"
    // "always" - всегда добавлять скобки, "avoid" - только если в параметрах есть несколько аргументов
    arrowParens: "avoid",

    // Определяет максимальную длину строки, после которой Prettier будет переносить код на новую строку. По умолчанию 80
    printWidth: 80,

    // Управляет добавлением точек с запятой в конце выражений. Возможные значения: true, false
    semi: true,

    // Управляет использованием одинарных или двойных кавычек для строк. Возможные значения: true, false
    // true - использовать одинарные кавычки, false - использовать двойные
    singleQuote: true,

    // Управляет добавлением trailing запятых в объектах, массивах и параметрах функций. Возможные значения: "all", "es5", "none"
    // "all" - добавлять всегда, "es5" - добавлять только если есть несколько аргументов, "none" - никогда
    trailingComma: "es5",

    // Управляет отступами внутри объектов, массивов и функций. Возможные значения: 2, 4
    tabWidth: 4,
};
